Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 融合的时间比两人想象的都要长，因为是第一次炼制彩级灵丹，游小默不敢想象以前一样一心多用，他是一个步骤一个步骤来的，每一个步骤都很小心，精神高度集中，所以尽管时间变长了，却能保障成功率。
en_us: The process for refining took longer than anticipated, for the both of them. As it was the first time refining a rainbow pill, You XiaoMo didn't dare multi-task like usually. He took it step-by-step and was very careful at each one. With intense concentration, even if the time increased, the success rate was secured.

source: 血影不恼也不怒，“自然不是，我来是想提醒你，距离万年前的约定只剩下两年，到时你可不要让我失望。”
en_us: The blood figure didn't get irritated or angry. "Of course not. I came to warn you that there are only two years left of the promise you made ten thousand years ago. When the time comes, you better not disappoint me."

source: 血影愣了一下很快便反应过来，听到游小默的笑声便扫了他一眼，沉声道：“你还是老样子，总是喜欢误解别人的意思，不过看不出来你这么自信，难道你真的把所有的希望都寄托在这个小子身上？”
en_us: The blood figure was stunned for a moment before recovering very quickly. When he heard You XiaoMo's laugh, he swept a glance over him before lowering his voice. "You're the same as ever. You always like to misunderstand other people's intentions. However, I can't see you being so confident. Are you really entrusting all of your hopes to this little brat?"

source: 血影目光打量的看着他，轻笑道：“你现在的修为比我想象的高，我以为你真的去了中级位面，还在那里呆了万年，现在看来似乎不是那么一回事。”
en_us: The blood figure assessed him before laughing lightly. "Your cultivation base is higher than what I imagined it to be. I really thought that you would stay in the Middle Level Realm for ten thousand years, but it seems like that wasn't the case."

source: 血影转身朝他们看来，尽管模糊却仍然能看得出这是一张非常英俊的脸，突然露出一抹夺目兴味的笑容，目光落在凌霄身上，呵呵的笑道：“整个麒麟族我最不喜欢的人就是你，然而真正懂我的却是你，麟宵，万年不见，别来无恙！”
en_us: The blood figure turned and looked towards them. Even though it was blurry, they could still make out a very handsome face. It suddenly revealed a dazzling smile before its gaze landed on Ling Xiao, and it laughed. "The person I like the least in all of the Qilin Clan is you. But the only one who really understands me is also you. Lin Xiao (麟宵, not a typo), it's been an eternity since we last met, I trust that you've been well!"

source: 血影顿了一下，英俊的脸上露出一个难看的笑容吧，“你知道吗，我最讨厌你总是用这幅表情说这种话。”
en_us: The blood figure paused for a second before an ugly smile appeared on his handsome face. "Do you know that what I hate the most is you using that expression to say those kinds of words."

source: 行人纷纷退到安全区域，待他们看清被踢飞的人后，大街上响起一阵倒抽气声。
en_us: The crowd quickly retreated to safety but once they saw who was kicked out, the street was filled with gasps-the sudden intake of air. (抽气声)

source: 街上到处都是五大三粗的男人，女性反而很少见到，偶尔才能看到几个，正所谓物以稀为贵，尽管女人长得平平凡凡，在这里却很受男人们的欢迎。
en_us: The streets were full of big and tall men. Women were rarely seen and only a few were occasionally sighted. This was the so-called 'a thing is valued if it is rare'. Despite how ordinary the women looked, they were very popular with men here.

source: 街上围观的人群一瞬间跑光了。
en_us: The crowd of onlookers on the street ran away in a flash.

source: 街上的人群从四面八方涌出来，皆朝同一个方向跑去。
en_us: The crowd was coming from all directions, but all running in the same direction.

source: 街上的情况和他们离开前一般无二，完全没有被这段时间发生的事情影响到，只是多了许多八卦可以聊。
en_us: The situation on the streets was the same as before, completely unfazed by the stuff that has happened recently, maybe just a few more stuff to gossip about.

source: 被主人警告过的她绝对和金翅虫一阵上蹿下跳后就安静了下来，一跳一飞的落在游小默左边的石床空位上，三双无辜的眼睛静静的看着他们的主人。
en_us: Having been warned by their master, the metal swallowing beast and golden winged insects calmed after jumping around for a while. They settled themselves in the empty space on the bed left of You XiaoMo, three pairs of innocent eyes quietly gazing at their master.

source: 被他们嫌弃自己做的饭菜，万厨师虽然生气，但也不敢表现出来，他得罪不起这些人，只好忍气吞声的解释道：“三位仙师，我做的饭菜就是这个味道。”
en_us: Seeing their dislike towards his food, Chef Wan was angry but he couldn't show it, since he couldn't afford to offend them. Swallowing his anger, he explained, "Practitioners(仙师), this is the flavor of my dishes."

source: 被他威胁扣伙食费的吞金兽和乒乓球，此时正打起十二分精神在灵水湖附近看守着，三双眼睛贼溜溜的转动着。
en_us: The Metal Swallowing Beast and Ping Pong were currently guarding over the spiritual water lake (灵水湖) with 120% devotion, since You Xiaomo had threatened to reduce their food expenses. Three pairs of eyes rolled towards him when he entered.

source: 被他弹到的地方顿时哄了，游小默也顾不得疼痛，他脑子里因为这句话闪过一个人，郁闷的表情霎时变成一脸惊喜，“你是说傅苍穹？”
en_us: The place where he was hit went red. You XiaoMo didn't care about the pain though, because the words caused a person to pop up in his mind. His depressed expression immediately turned into one of delight. "You mean Fu CangQiong?"

source: 被凌霄杀死的黑袍人陨落后对黑蜘蛛造成的影响很大，因为唯一的圣境强者死了，他们之中修为最高不过神境七星巅峰，想要与各大势力争夺灵丹八府的东西显然还不够，而且还有可能被借口斩杀。
en_us: Ling Xiao killing the black-robed person had an extremely large impact on the Black Spider. Because their only Sacred Realm expert died, their next highest cultivator was only at the seven star pinnacle Divine Realm level, and it was clearly not enough to compete with the other major powers over the magic pills and items in the Eight Mansions. It was even possible that it would be used as an excuse to kill them.

source: 被凌霄耍了，原来他早就知道他在域主府里，并且从头看到尾，传音石之所以能接通，是因为他的人现在就在领域里，但是这货根本就没用传音石跟他对话，而是直接传音给他。
en_us: Ling Xiao had tricked him again. The other had known he was in the City Master's estate from the beginning and had watched the entire thing play out. The reason the transmission stone could connect was because the other was in the Territory right now, but this guy wasn't using the transmission stone to speak to him at all, but directly transmitting his voice over.

source: 被压制住的水妖发出尖锐的叫喊声，像金属摩擦一样非常刺耳，饱含着愤怒与不甘，但是没有了四肢，它就像没有爪牙的猎豹。
en_us: The contained Water Demon made a sharp piercing scream, like the sound of scratching metal, it pierced through the ear drums. It was full of anger and dissatisfaction, but without it's limbs, it was just like a leopard without it's claws.

source: 被反驳的哑口无言，游小默还是只能和他一起进乌山集镇，不过为了避免被古玛部落的人认出来，游小默从空间拿出他在集九镇买的两套衣服，一套给凌霄换上，一套是他自己，这样别人就不会一眼认出他们是外来的。
en_us: Rendered speechless, You XiaoMo could only go into the WuShan Town with him. But, to prevent them from being recognized, You XiaoMo pulled out two outfits he bought from the JiJiu Town out of his dimension. One, he gave to Ling Xiao, he other, he kept for him self so that no one could tell, with one look at least, that they were outsiders.

source: 被圣境强者夸奖，游小默忍不住飘飘然。
en_us: You XiaoMo could not help but be elated after being complimented by a Sacred Realm expert.

source: 被沙尘迷失了视线的独眼刀疤却没有在第一时间发现，等他发现不对劲的时候，一张年轻平凡的脸蓦然出现在他面前，看到他，他立刻露出一个笑容。
en_us: One-Eyed Scarface didn't immediately notice due to the dust that had been whipped up. By the time he noticed, that young, average face had suddenly appeared in front of him, giving an abrupt smile when he saw the other looking.

source: 被点到名的黄鼠兽默默的低下头。
en_us: The called upon Ground Squirrel Beast silently lowered it's head.

source: 被瘴气折磨得奄奄一息的江流突然剧烈的挣扎起来，他能感觉到站在他面前的‘人’，心中的恐惧霎时将他淹没，可是他的挣扎在水妖眼里就像毛毛细雨，不值一提，接下他就被水妖扔进寒潭之中，水妖似乎不屑于杀他。
en_us: Jiang Liu who was tormented by the miasma till he was at the gate of death suddenly began to struggle violently. He could feel the 'man' standing in front of him and his fear instantly drowned him. However, his struggle was like fine drizzling rain in the eyes of the water demon and was even not worth mentioning. Then he was thrown into the cold lake by the Water Demon. The Water Demon seemed to feel that killing him was beneath its dignity.

source: 被黑雾笼罩的妖坟场此时就在他们脚下，妖坟场的面积非常大，一眼辽阔无边，到处都是些残破灰败坟墓，有些坟墓前堆着凌乱的骸骨，有人类的，也有妖兽的。
en_us: Right now, the demon beast graveyard was below them, shrouded in black fog. The demon beast graveyard was extremely large, and it was vast and boundless at first glance. Broken-down, dusty and decayed graves were everywhere, and there were skeletons piled disorderly in front of some of the graves, both human and demon beast.

source: 装也要装得像一点，这么容易就被人识破，我真怀疑你们的智商比我还低。”游小默说到智商二字的时候，特别的理直气壮，他老人家已经被凌霄潜隐默化了，现在都承认自己的智商低。
en_us: If you want to pretend, you also have to be on point. I really suspect that your IQ is lower than mine for you to have been seen through so easily." When You XiaoMo said this word 'IQ', he was particularly bold and confident. He, this old fellow, had been imperceptibly influenced (潜隐默化) by Ling Xiao and he was now admitting that his IQ was low. (他老人家已经被凌霄潜隐默化了，现在都承认自己的智商低。)

source: 装死的游小默立刻睁开眼睛，一把从床上跃了起来，急忙道：“不要，我起来了，你不能扔下我。
en_us: You XiaoMo who was pretending to be dead immediately opened his eyes and jumped up from the bed. He hurriedly exclaimed, "No, don't! I'm up, you can't abandon me here. (你不能扔下我)

source: 西境最近传得沸沸扬扬的流言他们早在第一时间就收到消息，这件事明显是有人在搞鬼，陷害天狗，但不是人人都能想到这一层，最近一段时间，鬼冢山脉就出现很多不明人物。
en_us: They had gotten immediate word of the rumors that had been spread across Xi Jing recently. Someone was clearly behind this, trying to kick dirt on TianGou, but not everyone would think of that. Recently, quite a few unknowns had appeared in Ghost Tomb Mountain Range.

source: 西境或许有这种灵草，比如鬼冢山脉的妖坟场，但是真正敢进入妖坟场的人却没有几个，要坟场葬有许多打妖兽大神通的坟场，轻易便会陨落，以此即便是天狗的成员也很少去除妖坟场的眉头。
en_us: Xi Jing might have this kind of magic herb in places such as the Demon Beast Graveyard in the Ghost Tomb Mountain Range, but there weren't that many people who actually dared to go into the Demon Beast Graveyard. The Demon Beast Graveyard contained the tombs of many large demon beasts and powerful experts, so if you took it lightly, you would meet your downfall. Therefore, even Tian Gou's members very rarely went to the Demon Beast Graveyard.

source: 西境是一种极其适合灵草生长的地域，这里覆盖着许多原始植被，其中便包括许多种植了千万年却没被发现或采摘的灵草，但是由于妖兽不会炼丹，西境又是妖兽遍地走的危险地域，所以西境的灵草极其丰富。
en_us: The Western Continent was somewhere that was highly suited for the growth of magic herbs. It was covered with many types of primeval vegetation, including several types of magic herbs that hadn't been discovered or picked for tens of thousands of years. But because demon beasts couldn't refine pills, and Western Continent was a dangerous place where demon beasts roamed everywhere, the magic herbs on Western Continent were extremely plentiful.

source: 西境的势力以四灵为主。
en_us: The Four Divine Emperor Beasts were the cornerstone of the forces in Xi Jing. (西境的势力以四灵为主)

source: 西境的北面靠近汪洋的大海，除了通灵玄龟，那里还生存着其他龟族，大多是生活在通灵玄龟的庇佑之下。
en_us: The northern side of Xi Jing was near a vast ocean. There were other Tortoise Clans living there besides the Psychic Black Turtles and most were living under the protection of the Psychic Black Turtles.

source: 西境的妖兽虽然不会炼丹，但是他们知道灵草对人类的重要性，因此大部分妖兽都会收集一些灵草，然后与人类丹师换取灵丹妙药。
en_us: Although the demon beasts in Western Continent didn't know how to refine pills, they knew of the importance of magic herbs to the humans. Therefore, the majority of demon beasts would collect a few magic herbs and and exchange it with human mages for their magic pills.

source: 要不他有先见之明，让吞金兽三只分别守在三个出口，这回恐怕已经被它逃走了，为了伙食费不被克扣，他们把吃奶的劲都试出来了。
en_us: If it wasn't for the fact that he had the foresight to get the Metal Swallowing Beast and co to each guard one of the three exits, it'd have probably escaped by now. In order to not have their food deducted, they had given it their all.

source: 要不是知道他们还杀了人做成人肉包子，游小默说不定真的会有那么一丝丝动摇，抢劫和杀人这种事很多人都干，但也还是有区别的。
en_us: If it wasn't for the fact that he knew they had killed people and cooked them to serve in dishes, You XiaoMo might've been somewhat moved. Robbery and killing was something many people did, but there was still a difference.

source: 要不是背景不对，游小默会忍不住笑出声，为了不辜负吞金兽的努力，他立刻加快速度冲过去。
en_us: If it wasn't the right time, You XiaoMo would have laughed out loud. To not have it's efforts go to waste, he hurried over as well.

source: 要不是那个人，他也不可能坐上自然城第一的宝座。
en_us: If it wasn't for 'that' person, he wouldn't have been able to take the seat of number one in ZiRan City.

source: 要是四品的时候也卡一下，五品的时候卡一下，两年后他未必能晋级为六品丹师，何况还是要和通天殿比。
en_us: If he got stuck at Grade Four for a while and also get stuck at Grade Five for some time, he may not be able to advance to a Grade Six mage after two years. Furthermore, he also had to compete with the TongTian Palace.

source: 要是死了，他还谈什么让莫雪对他死心塌地，以莫雪无情无义的性格，估计很快就会忘记他。
en_us: If he died then what would be the point of capturing her heart. With her heartlessness, she would probably forget him soon after.

source: 要知道他以往只吃最好的金属，现在吃他这么点金属已经是对他最大的恩赐了，轻蔑地看了黄鼠獣一眼，吞金兽又回到屋顶。
en_us: It must be known that that he was used to eating only the best metals (金属), and it was already the greatest charity for him to have eaten such a small piece of metal (金属). The Metal Swallowing Beast looked at the Ground Squirrel Beast in contempt, before he returned to the roof.

source: 要知道他的单方并不是普通的丹方，远古的丹方很多都是这个时代没有的，而且灵丹的效果也更加好。
en_us: His pill recipes wern't normal pill recipes after all. Ancient pill recipes were something that generally didn't exist anymore in this time, and the effects of the pills were better, too.

source: 要知道夏姐姐可是古玛部落除他们父亲之外实力最强的。
en_us: They would make them know that Sister Xia was the strongest one in the Guma Tribe, besides their own father.

source: 要知道，天鬼到现在都没有找到，如果四灵真的要找他们讨回公道，鬼哭涯被发现是迟早的事情。
en_us: You had to realize that Tian Gui hadn't been found yet. If the Four Ancient Beast Clans really did want revenge, then Weeping Ghost Shore would eventually be discovered.

source: 要知道，一旦契约就代表着妖兽可能从此失去自由，所以如果不是有特殊原因，一般妖兽是不愿与人类契约的。
en_us: As everyone knows, once a demon beast enters a contract, it will lose it's freedom. Thus, if it wasn't for a special reason, normally a demon beast wouldn't be willing to enter a contract.

source: 要说有什么缺点的话，那就是被种下母蛊的人只会跟着公蛊，公蛊走到哪，它就会跟到哪，除非服下它，不过一旦服下就再也拿不出来，所以大概就死游震天会让一名弟子带着公蛊的最主要原因。
en_us: If there were any disadvantages, it was that the person who the female Gu is planted in could only follow the male Gu. It had to follow wherever the male Gu goes unless it was taken in (服下). However, once it was taken in, it can never be removed. Therefore, this is probably the main reason why that damned You ZhenTian was willing to let a disciple carry the male Gu.

source: 见一击落空，黄鼠獣突然冷笑一声，他的臂力可不止五百公斤，轻易又迅速地抡起铁锤朝那道金色残影砸过去，金影稍微错了下身，看似擦肩而过，黄鼠獣知道自己砸中了。
en_us: When he saw that the blow had missed, the Ground Squirrel Beast suddenly sneered. As his arm strength was more than five hundred kilograms, he easily and quickly lifted the hammer and swung it at the golden shadow. The golden shadow slightly lowered its body and the blow seemed to have brushed past it. However, the Ground Squirrel Beast knew he had hit it.

source: 见他们私自确定了合作，游小默忍不住插嘴，“没有丹方没有灵草，我就算空有本事也炼不出六品彩丹啊，傅盟主，你有没有那种六品彩丹的丹方啊？”
en_us: Seeing them secretly (私自) deciding to cooperate, You XiaoMo could not refrain from interrupting, "With no pill recipe and without the magic herbs, I can't make a six-colored pill if I have the ability to do so. Alliance Head Fu, do you have pill recipe for the six-colored pill?"

source: 见他已经忘记自己，青秋也不恼，拈着一撮头发笑道：“游同学还未加入学院前，曾经去过青霜阁，那时帮你鉴定灵丹的人正是小女子，不知游同学还记得否？”
en_us: Seeing that he had already forgotten her, Qing Qiu didn’t think too much of it. Instead, she just twisted a lock of hair between her fingers and smiled, saying, “Before You-tongxue came to the academy, you briefly went to QingXiang sect, the one who helped you identify your soul was me, might you recall?”

source: 见他没说话啊，游小默还以为不收灵晶，合计的说道：“那不如这样吧，这些灵草先放你这儿……”
en_us: Hearing no reply, You XiaoMo assumed that he wasn't going to take spirit gems and (合计) comprimised, "Then how about this, you hold onto them for now..."

source: 见他说得一副胸有成竹的模样，游小默一脸诧异，“为什么这么说？”
en_us: You XiaoMo asked in astonishment upon seeing his self-assured demeanor, "Why do you say so?"

source: 见他迟迟不回答，星罗城主的表情又冷了几分，“既然你执意要找死，老夫便成全你。”说完他的身影就消失在原地。
en_us: Seeing that he was not answering, the expression of the Starfall City Master chilled a few degrees, "Since you're insistent on courting death, this old man will fulfill your wish." With that, his figure disappeared from its place.

source: 见众人的视线都集中在他身上，王老板从容的回道：“这个嘛，我只能跟你们说，咱们小镇确实有一位高人，另外，你们说话的声音最好小声一点，要是吵到那位高人，后果可是很严重的。”
en_us: Seeing that everyone's gaze was focused on him, owner Wang replied with ease, "About that, all I can say is that there really is an elite within our town. (高人) Not only that, you guys should lower your volumes, if it becomes a bother to that eilte then there will be severe consequences."

source: 见凌霄斜眼看了过来，带笑的眼睛不像要放过他的样子。
en_us: Ling Xiao glanced over at him, his smile telling him that there would be no mercy.

source: 见凌霄的情况还不错，游小默走出房间，一边打哈欠一边下楼，在楼梯口遇到刚好上楼的掌柜。
en_us: Seeing that Ling Xiao's condition wasn't bad, You XiaoMo walked out of the room, yawning. At the staircase, he was met with the shopkeeper.

source: 见她们要出去，谢俊立刻走过来。
en_us: Seeing them go out, Xie Jun immediately came over.

source: 见此情景，拍卖师面沉如水，眼神看向之前开口问话的黑袍人隐晦的闪过一丝不善，黑蜘蛛的成员没有一个是好人，包括他。
en_us: Seeing the situation, the auctioneer's face became gloomy, and a hidden hint of ill will flashed across his eyes as he looked at the black-robed person who had just spoke. Not a single member of the Black Spider was a good person, including him.

source: 见游小默看过来，下意识的抬高下巴，一脸绝强降雨桀骜。
en_us: Seeing that You XiaoMo looked over, she subconsciously raised her chin, in stubborn defiance.

source: 见状，游小默摸摸鼻子，“我口述给你听，这是黑蜘蛛的邀请帖，它邀请我们去参加它举办的拍卖会。”
en_us: Seeing this, You XiaoMo rubbed his nose. "I'll tell you what it says. It's an invite from the Black Spider; they want us to attend their auction."

source: 见状，青秋知道自己唐突了，撩了撩肩膀的发丝，有些失望地说道：“拍歉，是我唐突了，我还有事，先走了，再见！”
en_us: Seeing this, Qing Qiu realized her own brusqueness and fiddled with the strands of hair at her shoulder, disappointed. “Sorry, that was a bit abrupt of me. I need to go now, goodbye!”

source: 观察了半个月，他们终于确定消失的火鸡都被房屋的主任宰杀了，而且那个人做的火鸡比他们做的要好吃一百倍，光闻香气就知道了。
en_us: After observing it for half a month, they finally confirmed that the disappearing turkeys had all been killed by the master of this house. Moreover, the turkeys that that person made were a hundred times tastier than the ones they made, and you could tell just from the scent.

source: 视凌霄为敌人的麟昊武和姬芮，他们虽然很想哄抬价格，但是万一失败，对方不吃这一套怎么办？
en_us: Lin HaoWu and Ji Rui viewed Ling Xiao as an enemy and wanted to mess with Ling Xiao and inflate the price, but what if they failed and their opponent didn't fall for it?

source: 解决了雷劫，游小默将企图逃走的灵丹收进瓶子里，等他跑到外面，黄鼠兽却告诉他凌霄出去了还没回来。
en_us: After resolving the lightning tribulation, You XiaoMo put the magic pill which had tried to escape into the bottle, and when he ran outside, the Weasel Beast told him that Ling Xiao had not come back yet after going out.

source: 解决完衣服，游小默才想起重点，转过身，“你觉得谁会不经我同意就进入我的房间？”
en_us: After packing away the clothes, You XiaoMo then remembered the key point and turned around, "Who do you think would enter my room without my permission?"

source: 言下之意就是劝他乖乖束手就擒。
en_us: Basically implying that he should be good and surrender.

source: 言下之意就是打定主意要坑他们了。
en_us: This was implying that she was dead set on scamming them.

source: 言下之意就是，游小默的红卡并不是靠他自己得来的，十有八九是段奇天给的。
en_us: What she implied was that You XiaoMo didn’t obtain that card through his own merit, but most likely got it from Duan QiTian.

source: 言下之意，就是要花一千万灵晶去买一枚空间符就对了。
en_us: What he meant was that they had to spend ten million spirit gems to buy a teleportation talisman/

source: 警告完他的契约兽，游小默盘腿坐在床上，他拿出那枚固心丹一口吞下，接着就闭起眼睛修炼起来。
en_us: After warning his contracted demon beasts, You XiaoMo crossed his legs and sat, ingesting the Heart Fortification Pill before closing his eyes and beginning to cultivate.

source: 让他的人去跟踪一名十二阶强者？
en_us: Telling him to send his men to go tail a level twelve expert?

source: 让你鼻子这么灵，现在遭殃了吧。
en_us: Who asked your nose to be so keen. Now you've suffered a calamity.

source: 训练有素，又是同伙，必须的团体。
en_us: He was well-trained and was also an accomplice, so he had to be part of a group.

source: 论战斗的能力，夏音的实力其实比实际修为要低一些，最多只能和圣境四星的强者打成平手。
en_us: If it was about fighting prowess, Xia Yin was worse than her actual level. At most, she was on par with a Sacred Realm four star practitioner.

source: 识海外，凌霄突然看到他嘴角露出一丝淡淡的笑意，看来是抓到诀窍了，又看了眼他握在手心的内丹，能量还剩下三分之二，暂时应该不用担心。
en_us: Beyond the sea of consciousness, Ling Xiao suddenly saw the corner of his mouth curl into a smile. It looked like he found the trick and seeing that the pill (内丹) in his palm still had two-thirds of its energy, looked like he didn't have to worry for now.

source: 诚如他所说，积分对楼层越高的院生意义就越大，有些导师就是看中这一点，所以他们会根据不同的楼层看不同的价格。
en_us: Just like what Teacher Yang had said, the points held more significance to the students as the floor the students were on became higher. Some teachers took a fancy to this, so they would ask for different prices according to the floors the students were on.

source: 诚如银夫人所说，原来继承赤血家族家主之位的人应该是游小默的父亲，在还没宣布继承人的名字之前，上任家主很早之前就将传族之宝传给游小默的父亲。
en_us: As per what Madam Yin had mentioned, the original successor of the position for the ChiXue Clan Head should have been You XiaoMo's father. The previous Family Head had passed the Inheritance Jewel to You XiaoMo's father quite some time ago before the name of the successor was announced.

source: 话一出口，表情总显得漫不经心的甘长老突然挺直了背，探究的目光再度扫了过来，包括其他长老。
en_us: Elder Gan who always looked absent-minded suddenly straightened his back as soon as the words were uttered, and his and the inquiring eyes of the other elders swept over him again.

source: 话刚说完，白色的石碑突然亮了，外面好像笼罩着一层圣洁的白光，接着一道模糊的白影从石碑里飘了出来。
en_us: He had just finished speaking when the white gravestone suddenly lit up. The outside seemed to be enveloped in a kind of holy, white light, followed by a blurry white figure that floated up from the gravestone.

source: 话刚说完，黑袍甲就第一个动了。
en_us: He had just finished speaking when he moved first.

source: 话虽如此，游小默走了几步后，额头上已经出汗了。
en_us: Though this was true, You XiaoMo was already sweating with just a few steps.

source: 话还没说完，他的脑袋就被一只无形的手用力的敲了一下。
en_us: He hadn't even finished speaking when an invisible hand cuffed him over the head.

source: 话还没说完，毛球抬起另一只手在她另一边脸蛋又打了一巴掌，然后左右开弓打了十来下，直到她的脸肿成了馒头。
en_us: She hadn't even finished speaking when MaoQiu slapped her across her other cheek before slapping her over ten times in succession, left and right, until her face was swollen like a bun.

source: 话还没说完，黑袍人的身体突然爆开来，胸口心脏的位置多出一个血淋淋的窟窿，黑袍人张嘴似乎想说什么，人却倒了下去，什么动静也没有了。
en_us: He hadn't finished talking yet when his body suddenly exploded, leaving behind a bloody hole where his heart was. The black-robed person opened his mouth, as if he wanted to say something, but he had already fallen down, unmoving.

source: 话里丝毫听不出他们的歉意，说完，他便和另外四人抽身退走。
en_us: No hint of apology could be heard from their words. With that, he and the other four retreated.

source: 话音一落，一股霸道的气势瞬间自他体内爆发出来。
en_us: As soon as he finished speaking, a powerful aura instantly exploded from within him.

source: 话音一落，凌霄的身影再度消失。
en_us: As soon as he finished speaking, Ling Xiao's figure disappeared again.

source: 话音一落，在做不少人都惊喜起来。
en_us: As his words fell, many were pleasantly surprised.

source: 话音一落，她的身影几乎瞬间出现在凌霄身侧，连一秒都不用，接着一股红色炙热火焰便袭向凌霄的侧脸。
en_us: With that, almost in the same second, she appeared beside Ling Xiao. It didn't even take a second before a burning red flame erupted by Ling Xiao's face.

source: 话音一落，抽插的动作顿时比刚刚更加凶猛好几倍，激烈得好似要把他揉进骨血里一样，过了一会，游小默充满哭腔的声音便断断续续的响起来。
en_us: Just as he finished, the plunging (抽插) motion became much more violent, it was as if he wanted to combine their flesh and blood together. After a while, You XiaoMo's teary voice could be heard on and off.

source: 话音一落，有人垂头丧气的退了下去，也有人信心十足的走到五长老面前，在他面前，摆放着十个测试仪器。
en_us: As his words fell, some fell in disappointment, and some walked up to the Fifth Elder with confidence. In front of him, there were ten examiners.

source: 话音一落，气氛陷入沉默。
en_us: As his words fell, so did silence.

source: 话音一落，游震天的身体突然爆发出一股骇人的灵力，仿佛火山爆发那一刻的震撼，这才是圣境高星的实力，他的灵力是红色的，在他的背后仿佛能看到一只正在咆哮的猛虎，饱含着君临天下的气势。
en_us: He had just finished speaking when a shocking amount of spiritual energy suddenly exploded from You ZhenTian's body, causing everything to shake as if a volcano had just erupted. This was the strength of a Sacred high-star expert. His spiritual energy was red, and it seemed as if there was a ferocious tiger roaring behind him in an extremely imposing and domineering manner.
